{
  "vocab_size": 8192,
  "min_frequency": 2,
  "dataset_name": "open-web-math/open-web-math",
  "dataset_split": "train",
  "text_column": "text",
  "training_chunk_size": 1000,
  "max_training_samples": 200000,
  "special_tokens": [
    "<|bos|>",
    "<|eos|>",
    "<|pad|>",
    "<|unk|>",
    "<|question|>",
    "<|reasoning|>",
    "<|answer|>"
  ],
  "math_latex_tokens": [
    "\\frac",
    "\\sqrt",
    "\\pi",
    "\\sum",
    "\\int",
    "\\infty",
    "\\times",
    "\\div",
    "\\pm",
    "\\leq",
    "\\geq",
    "\\neq",
    "\\alpha",
    "\\beta",
    "\\gamma",
    "\\delta",
    "\\theta",
    "\\lambda",
    "\\mu",
    "\\sigma",
    "\\phi",
    "\\omega",
    "\\partial",
    "\\nabla",
    "\\forall",
    "\\exists",
    "\\rightarrow",
    "\\leftarrow",
    "\\Rightarrow",
    "\\Leftarrow",
    "\\subset",
    "\\supset",
    "\\subseteq",
    "\\supseteq",
    "\\cup",
    "\\cap",
    "\\in",
    "\\notin",
    "\\lim",
    "\\log",
    "\\ln",
    "\\sin",
    "\\cos",
    "\\tan",
    "\\exp",
    "\\max",
    "\\min",
    "\\sup",
    "\\inf",
    "\\binom",
    "\\choose",
    "\\cdot",
    "\\ldots",
    "\\cdots",
    "\\text",
    "\\mathrm",
    "\\mathbb",
    "\\mathcal"
  ]
}