{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2,
    "pad_type_id": 0,
    "pad_token": "<|pad|>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<|bos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|eos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|unk|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<|question|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<|reasoning|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<|answer|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "\r\n"
        },
        "content": "\n"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": "\r"
        },
        "content": "\n"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "UnicodeScripts"
      },
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": true
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<|bos|>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<|eos|>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<|bos|>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<|eos|>",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<|bos|>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<|eos|>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<|bos|>": {
        "id": "<|bos|>",
        "ids": [
          0
        ],
        "tokens": [
          "<|bos|>"
        ]
      },
      "<|eos|>": {
        "id": "<|eos|>",
        "ids": [
          1
        ],
        "tokens": [
          "<|eos|>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<|unk|>",
    "continuing_subword_prefix": "##",
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|bos|>": 0,
      "<|eos|>": 1,
      "<|pad|>": 2,
      "<|unk|>": 3,
      "<|question|>": 4,
      "<|reasoning|>": 5,
      "<|answer|>": 6,
      "!": 7,
      "\"": 8,
      "#": 9,
      "$": 10,
      "%": 11,
      "&": 12,
      "'": 13,
      "(": 14,
      ")": 15,
      "*": 16,
      "+": 17,
      ",": 18,
      "-": 19,
      ".": 20,
      "/": 21,
      "0": 22,
      "1": 23,
      "2": 24,
      "3": 25,
      "4": 26,
      "5": 27,
      "6": 28,
      "7": 29,
      "8": 30,
      "9": 31,
      ":": 32,
      ";": 33,
      "<": 34,
      "=": 35,
      ">": 36,
      "?": 37,
      "@": 38,
      "A": 39,
      "B": 40,
      "C": 41,
      "D": 42,
      "E": 43,
      "F": 44,
      "G": 45,
      "H": 46,
      "I": 47,
      "J": 48,
      "K": 49,
      "L": 50,
      "M": 51,
      "N": 52,
      "O": 53,
      "P": 54,
      "Q": 55,
      "R": 56,
      "S": 57,
      "T": 58,
      "U": 59,
      "V": 60,
      "W": 61,
      "X": 62,
      "Y": 63,
      "Z": 64,
      "[": 65,
      "\\": 66,
      "]": 67,
      "^": 68,
      "_": 69,
      "`": 70,
      "a": 71,
      "b": 72,
      "c": 73,
      "d": 74,
      "e": 75,
      "f": 76,
      "g": 77,
      "h": 78,
      "i": 79,
      "j": 80,
      "k": 81,
      "l": 82,
      "m": 83,
      "n": 84,
      "o": 85,
      "p": 86,
      "q": 87,
      "r": 88,
      "s": 89,
      "t": 90,
      "u": 91,
      "v": 92,
      "w": 93,
      "x": 94,
      "y": 95,
      "z": 96,
      "{": 97,
      "|": 98,
      "}": 99,
      "~": 100,
      "¡": 101,
      "¢": 102,
      "£": 103,
      "¤": 104,
      "¥": 105,
      "¦": 106,
      "§": 107,
      "¨": 108,
      "©": 109,
      "ª": 110,
      "«": 111,
      "¬": 112,
      "®": 113,
      "¯": 114,
      "°": 115,
      "±": 116,
      "²": 117,
      "³": 118,
      "´": 119,
      "µ": 120,
      "¶": 121,
      "·": 122,
      "¸": 123,
      "¹": 124,
      "º": 125,
      "»": 126,
      "¼": 127,
      "½": 128,
      "¾": 129,
      "¿": 130,
      "À": 131,
      "Á": 132,
      "Â": 133,
      "Ã": 134,
      "Ä": 135,
      "Å": 136,
      "Æ": 137,
      "Ç": 138,
      "È": 139,
      "É": 140,
      "Ê": 141,
      "Ë": 142,
      "Ì": 143,
      "Í": 144,
      "Î": 145,
      "Ï": 146,
      "Ð": 147,
      "Ñ": 148,
      "Ò": 149,
      "Ó": 150,
      "Ô": 151,
      "Õ": 152,
      "Ö": 153,
      "×": 154,
      "Ø": 155,
      "Ù": 156,
      "Ú": 157,
      "Û": 158,
      "Ü": 159,
      "Ý": 160,
      "Þ": 161,
      "ß": 162,
      "à": 163,
      "á": 164,
      "â": 165,
      "ã": 166,
      "ä": 167,
      "å": 168,
      "æ": 169,
      "ç": 170,
      "è": 171,
      "é": 172,
      "ê": 173,
      "ë": 174,
      "ì": 175,
      "í": 176,
      "î": 177,
      "ï": 178,
      "ð": 179,
      "ñ": 180,
      "ò": 181,
      "ó": 182,
      "ô": 183,
      "õ": 184,
      "ö": 185,
      "÷": 186,
      "ø": 187,
      "ù": 188,
      "ú": 189,
      "û": 190,
      "ü": 191,
      "ý": 192,
      "þ": 193,
      "ÿ": 194,
      "Ā": 195,
      "ā": 196,
      "Ă": 197,
      "ă": 198,
      "Ą": 199,
      "ą": 200,
      "Ć": 201,
      "ć": 202,
      "Ĉ": 203,
      "ĉ": 204,
      "Ċ": 205,
      "ċ": 206,
      "Č": 207,
      "č": 208,
      "Ď": 209,
      "ď": 210,
      "Đ": 211,
      "đ": 212,
      "Ē": 213,
      "ē": 214,
      "Ĕ": 215,
      "ĕ": 216,
      "Ė": 217,
      "ė": 218,
      "Ę": 219,
      "ę": 220,
      "Ě": 221,
      "ě": 222,
      "Ĝ": 223,
      "ĝ": 224,
      "Ğ": 225,
      "ğ": 226,
      "Ġ": 227,
      "ġ": 228,
      "Ģ": 229,
      "ģ": 230,
      "Ĥ": 231,
      "ĥ": 232,
      "Ħ": 233,
      "ħ": 234,
      "Ĩ": 235,
      "ĩ": 236,
      "Ī": 237,
      "ī": 238,
      "Ĭ": 239,
      "ĭ": 240,
      "Į": 241,
      "į": 242,
      "İ": 243,
      "ı": 244,
      "Ĳ": 245,
      "ĳ": 246,
      "Ĵ": 247,
      "ĵ": 248,
      "Ķ": 249,
      "ķ": 250,
      "ĸ": 251,
      "Ĺ": 252,
      "ĺ": 253,
      "Ļ": 254,
      "ļ": 255,
      "Ľ": 256,
      "ľ": 257,
      "Ŀ": 258,
      "ŀ": 259,
      "Ł": 260,
      "ł": 261,
      "Ń": 262,
      "##j": 263,
      "##e": 264,
      "##n": 265,
      "##d": 266,
      "##r": 267,
      "##a": 268,
      "##p": 269,
      "##s": 270,
      "##m": 271,
      "##o": 272,
      "##b": 273,
      "##i": 274,
      "##l": 275,
      "##t": 276,
      "##I": 277,
      "##c": 278,
      "##{": 279,
      "##%": 280,
      "##|": 281,
      "##.": 282,
      "##'": 283,
      "##h": 284,
      "##f": 285,
      "##g": 286,
      "##k": 287,
      "##u": 288,
      "##K": 289,
      "##w": 290,
      "##y": 291,
      "##z": 292,
      "##A": 293,
      "##U": 294,
      "##N": 295,
      "##T": 296,
      "##V": 297,
      "##C": 298,
      "##W": 299,
      "##ï": 300,
      "##¿": 301,
      "##½": 302,
      "###": 303,
      "##v": 304,
      "##P": 305,
      "##G": 306,
      "##S": 307,
      "##L": 308,
      "##B": 309,
      "##E": 310,
      "##R": 311,
      "##M": 312,
      "##x": 313,
      "##Ã": 314,
      "##¶": 315,
      "##è": 316,
      "##¥": 317,
      "##Ĺ": 318,
      "##ı": 319,
      "##é": 320,
      "##«": 321,
      "##ĺ": 322,
      "##å": 323,
      "##İ": 324,
      "##Ł": 325,
      "##æ": 326,
      "##£": 327,
      "##®": 328,
      "##ŀ": 329,
      "##ç": 330,
      "##Ķ": 331,
      "##Ģ": 332,
      "##ģ": 333,
      "##ĩ": 334,
      "##į": 335,
      "##Ĥ": 336,
      "##¹": 337,
      "##ª": 338,
      "##Į": 339,
      "##¤": 340,
      "##D": 341,
      "##O": 342,
      "##H": 343,
      "##_": 344,
      "##@": 345,
      "##F": 346,
      "##q": 347,
      "##X": 348,
      "##J": 349,
      "##<": 350,
      "##>": 351,
      "##Z": 352,
      "##´": 353,
      "##&": 354,
      "##=": 355,
      "##?": 356,
      "##Q": 357,
      "##`": 358,
      "##,": 359,
      "##ĸ": 360,
      "##Ń": 361,
      "##¦": 362,
      "##ľ": 363,
      "##§": 364,
      "##ħ": 365,
      "##¨": 366,
      "##ĕ": 367,
      "##]": 368,
      "##}": 369,
      "##¼": 370,
      "##á": 371,
      "##»": 372,
      "##ì": 373,
      "##Ħ": 374,
      "##Ŀ": 375,
      "##(": 376,
      "##+": 377,
      "##^": 378,
      "##ġ": 379,
      "##-": 380,
      "##Ĝ": 381,
      "##Ğ": 382,
      "##â": 383,
      "##Ļ": 384,
      "##Ī": 385,
      "##Ĵ": 386,
      "##±": 387,
      "##Ð": 388,
      "##Ñ": 389,
      "##°": 390,
      "##²": 391,
      "##[": 392,
      "##\\": 393,
      "##Y": 394,
      "##Ĩ": 395,
      "##ĵ": 396,
      "##©": 397,
      "##¬": 398,
      "##ł": 399,
      "##Ą": 400,
      "##º": 401,
      "##¸": 402,
      "##¾": 403,
      "##³": 404,
      "##ä": 405,
      "##ļ": 406,
      "##ĳ": 407,
      "##¢": 408,
      "##µ": 409,
      "##ĭ": 410,
      "##¯": 411,
      "##·": 412,
      "##Â": 413,
      "##ī": 414,
      "##ķ": 415,
      "##à": 416,
      "##Ĳ": 417,
      "##¡": 418,
      "##Ĭ": 419,
      "##ĥ": 420,
      "##Ê": 421,
      "##Ä": 422,
      "##$": 423,
      "##Ľ": 424,
      "##\"": 425,
      "##;": 426,
      "##*": 427,
      "##)": 428,
      "##ă": 429,
      "##:": 430,
      "##!": 431,
      "##ğ": 432,
      "##ė": 433,
      "##Ď": 434,
      "##Ø": 435,
      "##Ù": 436,
      "##Û": 437,
      "##~": 438,
      "##ď": 439,
      "##ć": 440,
      "##Ė": 441,
      "##Ę": 442,
      "##ã": 443,
      "##/": 444,
      "##ě": 445,
      "##ę": 446,
      "##ą": 447,
      "##ā": 448,
      "##đ": 449,
      "##Ĉ": 450,
      "##Î": 451,
      "##Ï": 452,
      "##ê": 453,
      "##í": 454,
      "##ë": 455,
      "##Ă": 456,
      "##Ë": 457,
      "##Æ": 458,
      "##Å": 459,
      "##È": 460,
      "##Đ": 461,
      "##É": 462,
      "##ē": 463,
      "##Ē": 464,
      "##Ć": 465,
      "##Ĕ": 466,
      "##Ě": 467,
      "##î": 468,
      "##ĝ": 469,
      "##ĉ": 470,
      "##×": 471,
      "##ð": 472,
      "##Ç": 473,
      "##Þ": 474,
      "##Ö": 475,
      "##Ò": 476,
      "##Ì": 477,
      "##Í": 478,
      "##Ġ": 479,
      "##Õ": 480,
      "##Ô": 481,
      "##ô": 482,
      "##ó": 483,
      "##Ċ": 484,
      "##ò": 485,
      "##ñ": 486,
      "##Ú": 487,
      "##Ý": 488,
      "##ß": 489,
      "##Ü": 490,
      "##Ó": 491,
      "##Č": 492,
      "##ċ": 493,
      "Ġt": 494,
      "##he": 495,
      "##in": 496,
      "Ġa": 497,
      "##on": 498,
      "##re": 499,
      "##at": 500,
      "Ġthe": 501,
      "##er": 502,
      "Ġs": 503,
      "Ġo": 504,
      "##en": 505,
      "##is": 506,
      "Ġc": 507,
      "##or": 508,
      "##al": 509,
      "##es": 510,
      "##it": 511,
      "##ion": 512,
      "##an": 513,
      "Ġf": 514,
      "Ġp": 515,
      "Ġof": 516,
      "Ġw": 517,
      "##ed": 518,
      "##ar": 519,
      "##nd": 520,
      "##ic": 521,
      "##ing": 522,
      "##le": 523,
      "Ġb": 524,
      "Ġm": 525,
      "Ġin": 526,
      "Ġd": 527,
      "##ou": 528,
      "##ct": 529,
      "Ġto": 530,
      "##ro": 531,
      "ĊĊ": 532,
      "Ġth": 533,
      "##as": 534,
      "##et": 535,
      "Ġe": 536,
      "##ent": 537,
      "##om": 538,
      "Ġis": 539,
      "Ġn": 540,
      "##st": 541,
      "##ve": 542,
      "Ġand": 543,
      "##ation": 544,
      "Ġre": 545,
      "##im": 546,
      "##ut": 547,
      "##ly": 548,
      "##ra": 549,
      "Ġl": 550,
      "##ot": 551,
      "##ll": 552,
      "Ġh": 553,
      "##ig": 554,
      "##ce": 555,
      "##ow": 556,
      "Ġg": 557,
      "##ol": 558,
      "##us": 559,
      "Ġfor": 560,
      "##ĠĠ": 561,
      "##ul": 562,
      "Ġbe": 563,
      "âĢ": 564,
      "##id": 565,
      "##am": 566,
      "##um": 567,
      "Ġthat": 568,
      "Ġon": 569,
      "##ch": 570,
      "##qu": 571,
      "##ver": 572,
      "##ith": 573,
      "##od": 574,
      "Ġan": 575,
      "The": 576,
      "##ur": 577,
      "Ġst": 578,
      "##if": 579,
      "Ġcon": 580,
      "##il": 581,
      "Ġpro": 582,
      "##el": 583,
      "and": 584,
      "##os": 585,
      "##un": 586,
      "Ġy": 587,
      "##ay": 588,
      "##ate": 589,
      "##ge": 590,
      "##ction": 591,
      "##ri": 592,
      "Ġwith": 593,
      "##ab": 594,
      "Ġex": 595,
      "Ġas": 596,
      "Ġare": 597,
      "Ġit": 598,
      "##ter": 599,
      "##pl": 600,
      "the": 601,
      "Ġv": 602,
      "##ir": 603,
      "Ġ\\": 604,
      "ĠS": 605,
      "Ġyou": 606,
      "##pe": 607,
      "##ist": 608,
      "##em": 609,
      "##ure": 610,
      "Ġus": 611,
      "##ity": 612,
      "##igh": 613,
      "##nt": 614,
      "Ġcom": 615,
      "##ad": 616,
      "ĠI": 617,
      "##ere": 618,
      "##est": 619,
      "##se": 620,
      "##her": 621,
      "##..": 622,
      "ĠC": 623,
      "Ġ(": 624,
      "##ore": 625,
      "##ef": 626,
      "##ive": 627,
      "##ple": 628,
      "Ġby": 629,
      "##iv": 630,
      "Ġr": 631,
      "Ġthis": 632,
      "ĠA": 633,
      "Ġcan": 634,
      "##ers": 635,
      "$$": 636,
      "##ant": 637,
      "##ight": 638,
      "##ment": 639,
      "##ac": 640,
      "##pt": 641,
      "##rom": 642,
      "##ine": 643,
      "##res": 644,
      "##ave": 645,
      "ĠP": 646,
      "Ġse": 647,
      "ĠM": 648,
      "##ical": 649,
      "##per": 650,
      "##ial": 651,
      "Ġor": 652,
      "##ill": 653,
      "Ġal": 654,
      "Ġat": 655,
      "Ġnot": 656,
      "##ess": 657,
      "##ke": 658,
      "##art": 659,
      "####": 660,
      "##and": 661,
      "##ain": 662,
      "##ld": 663,
      "Ġwe": 664,
      "##ĠĠĠĠ": 665,
      "##oc": 666,
      "Ġwh": 667,
      "in": 668,
      "##ect": 669,
      "Ġsu": 670,
      "##ath": 671,
      "##ies": 672,
      "Ġne": 673,
      "##pp": 674,
      "##ich": 675,
      "ĠT": 676,
      "##ble": 677,
      "##og": 678,
      "Ġfrom": 679,
      "##iz": 680,
      "âĢ¢": 681,
      "Ġhave": 682,
      "Ġde": 683,
      "##ag": 684,
      "##ult": 685,
      "##ould": 686,
      "##ations": 687,
      "Ġsh": 688,
      "Th": 689,
      "##orm": 690,
      "##th": 691,
      "##te": 692,
      "##--": 693,
      "Ġch": 694,
      "##rac": 695,
      "##ue": 696,
      "##all": 697,
      "##ions": 698,
      "Ġpo": 699,
      "##age": 700,
      "##ber": 701,
      "##ud": 702,
      "##ort": 703,
      "##ated": 704,
      "##int": 705,
      "In": 706,
      "##ust": 707,
      "##end": 708,
      "ĠR": 709,
      "Ġme": 710,
      "##able": 711,
      "ĠF": 712,
      "ĠE": 713,
      "is": 714,
      "Ġu": 715,
      "##act": 716,
      ").": 717,
      "âĢĻ": 718,
      "ĠD": 719,
      "Ġ=": 720,
      "##ph": 721,
      "##{\\": 722,
      "ĠB": 723,
      "Ġhe": 724,
      "##ome": 725,
      "ĠL": 726,
      "Ġle": 727,
      "##du": 728,
      "##our": 729,
      "Ġqu": 730,
      "##xt": 731,
      "##ass": 732,
      "##unction": 733,
      "##ans": 734,
      "##ens": 735,
      "##ach": 736,
      "##ind": 737,
      "##rou": 738,
      "Ġdo": 739,
      "Ġres": 740,
      "##$$": 741,
      "Ġnum": 742,
      "Ġall": 743,
      "##ther": 744,
      "Ġcomp": 745,
      "Ġab": 746,
      "##fere": 747,
      "##ase": 748,
      "##ard": 749,
      "##ang": 750,
      "##ork": 751,
      "##ide": 752,
      "Ġim": 753,
      "##ff": 754,
      "##ime": 755,
      "Ġwill": 756,
      "##ari": 757,
      "Ġmod": 758,
      "##ame": 759,
      "##ap": 760,
      "##ener": 761,
      "math": 762,
      "ĠG": 763,
      "##ence": 764,
      "##ost": 765,
      "Ġequ": 766,
      "frac": 767,
      "Ġtr": 768,
      "##hen": 769,
      "##are": 770,
      "}}": 771,
      "Ġk": 772,
      "##ite": 773,
      "##ary": 774,
      "##ace": 775,
      "ĠN": 776,
      "##ign": 777,
      "##ition": 778,
      "##op": 779,
      "wh": 780,
      "##âĢ": 781,
      "Ġint": 782,
      "th": 783,
      "),": 784,
      "##out": 785,
      "##ance": 786,
      "##ics": 787,
      "Ġcl": 788,
      "Ġun": 789,
      "##ec": 790,
      "$\\": 791,
      "##ew": 792,
      "##ally": 793,
      "##ys": 794,
      "##erm": 795,
      "Ġcont": 796,
      "##ep": 797,
      "Ġfunction": 798,
      "Ġone": 799,
      "_{": 800,
      "##ire": 801,
      "This": 802,
      "##ak": 803,
      "##ata": 804,
      "}{": 805,
      "##ous": 806,
      "Ġ-": 807,
      "##ack": 808,
      "Ġval": 809,
      "or": 810,
      "ĠH": 811,
      "##eg": 812,
      "Ġwas": 813,
      "##here": 814,
      "##ast": 815,
      "##wo": 816,
      "Ġdif": 817,
      "...": 818,
      "Ġad": 819,
      "##ond": 820,
      "Ġpl": 821,
      "##cc": 822,
      "we": 823,
      "##ong": 824,
      "##ution": 825,
      "Ġsy": 826,
      "ĠĠ": 827,
      "##form": 828,
      "##ric": 829,
      "##gh": 830,
      "##ub": 831,
      "Ġmat": 832,
      "##__": 833,
      "##so": 834,
      "##ip": 835,
      "##ru": 836,
      "##cl": 837,
      "##ile": 838,
      "##ress": 839,
      "Ġsp": 840,
      "##oll": 841,
      "##ree": 842,
      "##ok": 843,
      "Ġout": 844,
      "Ġhas": 845,
      "Ġ+": 846,
      "##ord": 847,
      "##ents": 848,
      "##ors": 849,
      "Ġform": 850,
      "Ġob": 851,
      "##etw": 852,
      "##ext": 853,
      "to": 854,
      "Ġpre": 855,
      "We": 856,
      "but": 857,
      "Ġtwo": 858,
      "##ory": 859,
      "Ġsc": 860,
      "##eth": 861,
      "Ġsol": 862,
      "Ġar": 863,
      "##ose": 864,
      "##rib": 865,
      "##av": 866,
      "##ry": 867,
      "##ound": 868,
      "Ġif": 869,
      "Ġper": 870,
      "Ġj": 871,
      "}$": 872,
      "##ample": 873,
      "##vel": 874,
      "##ject": 875,
      "Ġmore": 876,
      "##put": 877,
      "Ġdis": 878,
      "Ġpart": 879,
      "##lect": 880,
      "Ġspe": 881,
      "##ike": 882,
      "Ġsome": 883,
      "Ġnumber": 884,
      "##cul": 885,
      "Ġdiffere": 886,
      "Ġother": 887,
      "Ġyour": 888,
      "Ġset": 889,
      "Ġver": 890,
      "##stem": 891,
      "##blem": 892,
      "##ram": 893,
      "Ġwhich": 894,
      "##ates": 895,
      "for": 896,
      "Ġsim": 897,
      "Ġany": 898,
      "##now": 899,
      "##ative": 900,
      "##ib": 901,
      "right": 902,
      "Ġ$": 903,
      "ĠO": 904,
      "ĠâĢ": 905,
      "Ġuse": 906,
      "If": 907,
      "ĠW": 908,
      "##hem": 909,
      "Ġtime": 910,
      "##ake": 911,
      "Ġmodel": 912,
      "##irst": 913,
      "Ġpoint": 914,
      "which": 915,
      "##aus": 916,
      ".,": 917,
      "It": 918,
      "##ook": 919,
      "Ġinter": 920,
      "##ces": 921,
      "##ear": 922,
      "##one": 923,
      "at": 924,
      "Ġthan": 925,
      "Ġdef": 926,
      "Ġwork": 927,
      "Ġdata": 928,
      "Ġup": 929,
      "st": 930,
      "Ġvari": 931,
      "##les": 932,
      "}\\": 933,
      "##eft": 934,
      "Ġ.": 935,
      "{\\": 936,
      "##ice": 937,
      "Ġco": 938,
      "Ġalso": 939,
      "##ility": 940,
      "Ġwould": 941,
      "##ink": 942,
      "Ġpos": 943,
      "##ollow": 944,
      "Ġgo": 945,
      "left": 946,
      "it": 947,
      "âĢĵ": 948,
      "Ġen": 949,
      "Ġthere": 950,
      "##ail": 951,
      "##----": 952,
      "Ġusing": 953,
      "##": 954,
      "Ġev": 955,
      "Ġsub": 956,
      "Ġdist": 957,
      "Ġ[": 958,
      "Ġapp": 959,
      "Ġproblem": 960,
      "##een": 961,
      "##ps": 962,
      "##ode": 963,
      "Ġabout": 964,
      "ĠJ": 965,
      "##ific": 966,
      "##nder": 967,
      "al": 968,
      "##ont": 969,
      "Ġused": 970,
      "Ġx": 971,
      "Ġonly": 972,
      "##etween": 973,
      "##port": 974,
      "^{": 975,
      "##ange": 976,
      "##row": 977,
      "##ĠĠĠĠĠĠĠĠ": 978,
      "Ġits": 979,
      "Ġman": 980,
      "##ons": 981,
      "Ġgener": 982,
      "Ġso": 983,
      "##ell": 984,
      "Ġeach": 985,
      "##ax": 986,
      "##plic": 987,
      "Ġknow": 988,
      "##cre": 989,
      "##alcul": 990,
      "as": 991,
      "Ġsystem": 992,
      "##ular": 993,
      "Ġline": 994,
      "##ual": 995,
      "For": 996,
      "Ġget": 997,
      "##ove": 998,
      "##ating": 999,
      "Ġfollow": 1000,
      "ĠU": 1001,
      "Ġdifferent": 1002,
      "Ġind": 1003,
      "Ġass": 1004,
      "##vi": 1005,
      "Ġbetween": 1006,
      "##ature": 1007,
      "Ġrel": 1008,
      "Ġtrans": 1009,
      "Ġlike": 1010,
      "Ġneed": 1011,
      "##ount": 1012,
      "Ġresult": 1013,
      "Ġfirst": 1014,
      "##ator": 1015,
      "Ġcor": 1016,
      "##rad": 1017,
      "##iven": 1018,
      "##ethod": 1019,
      "##ible": 1020,
      "##ments": 1021,
      "##cess": 1022,
      "##ob": 1023,
      "##ft": 1024,
      "##ues": 1025,
      "##raph": 1026,
      "##ser": 1027,
      "##ied": 1028,
      "##ays": 1029,
      "##ia": 1030,
      "Wh": 1031,
      "##ize": 1032,
      "##iel": 1033,
      "Ġdes": 1034,
      "##ov": 1035,
      "Ġshow": 1036,
      "##nce": 1037,
      "Ġam": 1038,
      "##ta": 1039,
      "##pect": 1040,
      "Ġno": 1041,
      "Ġhow": 1042,
      "Ġsame": 1043,
      "##uch": 1044,
      "Ġ&": 1045,
      "Ġover": 1046,
      "##ks": 1047,
      "Ġwhen": 1048,
      "##low": 1049,
      "Ġpar": 1050,
      "Ġadd": 1051,
      "of": 1052,
      "text": 1053,
      "##ient": 1054,
      "##imes": 1055,
      "##ruct": 1056,
      "Ġvalue": 1057,
      "##oth": 1058,
      "##resent": 1059,
      "##ne": 1060,
      "##ined": 1061,
      "Ġinto": 1062,
      "ĠV": 1063,
      "##old": 1064,
      "Ġwhat": 1065,
      "Ġph": 1066,
      "##urn": 1067,
      "Ġdet": 1068,
      "##ield": 1069,
      "##ause": 1070,
      "##its": 1071,
      "Ġexp": 1072,
      "##ings": 1073,
      "##ract": 1074,
      "##ough": 1075,
      "Ġthese": 1076,
      "Ġro": 1077,
      "Ġ'": 1078,
      "##ise": 1079,
      "##olog": 1080,
      "##ian": 1081,
      "##ater": 1082,
      "Ġconst": 1083,
      "##ased": 1084,
      "Ġap": 1085,
      "Ġcons": 1086,
      "Ġcomm": 1087,
      "Ġunder": 1088,
      "##estion": 1089,
      "Ġmy": 1090,
      "Ġcur": 1091,
      "##rm": 1092,
      "##sw": 1093,
      "Ġ{": 1094,
      "##ower": 1095,
      "Ġthey": 1096,
      "if": 1097,
      "##rix": 1098,
      "##tain": 1099,
      "##ix": 1100,
      "Ġ\"": 1101,
      "##ype": 1102,
      "}^": 1103,
      "##tt": 1104,
      "##der": 1105,
      "Ġeff": 1106,
      "##ption": 1107,
      "##ie": 1108,
      "##ma": 1109,
      "Ġexample": 1110,
      ")$": 1111,
      "Ġag": 1112,
      "Ġtheir": 1113,
      "##ced": 1114,
      "ĠK": 1115,
      "##vers": 1116,
      "##nal": 1117,
      "Ġrec": 1118,
      "Ġreg": 1119,
      "Ġfind": 1120,
      "##gy": 1121,
      "with": 1122,
      "##amet": 1123,
      "Ġstud": 1124,
      "##ability": 1125,
      "re": 1126,
      "ĠĠĠ": 1127,
      "Ġspec": 1128,
      "Ġacc": 1129,
      "mathb": 1130,
      "Ġjust": 1131,
      "##clud": 1132,
      "Ġshould": 1133,
      "Ġprodu": 1134,
      "##eng": 1135,
      "##itt": 1136,
      "How": 1137,
      "Ġdoes": 1138,
      "Ġmethod": 1139,
      "Ġmay": 1140,
      "$$\\": 1141,
      "##ict": 1142,
      "Ġwere": 1143,
      "Ġcomple": 1144,
      "##ss": 1145,
      "Ġcalcul": 1146,
      "##ically": 1147,
      "ĠâĢĵ": 1148,
      "##ning": 1149,
      "com": 1150,
      "##asure": 1151,
      "Ġappro": 1152,
      "}_": 1153,
      "##rt": 1154,
      "##hemat": 1155,
      "##als": 1156,
      "##ick": 1157,
      "Ġnew": 1158,
      "so": 1159,
      "Ġinte": 1160,
      "Ġthem": 1161,
      "An": 1162,
      "##ci": 1163,
      "##very": 1164,
      "##ole": 1165,
      "âĪ": 1166,
      "Ġbec": 1167,
      "Ġbeen": 1168,
      "Ġrep": 1169,
      "âĢľ": 1170,
      "##yp": 1171,
      "Ġour": 1172,
      "##ved": 1173,
      "Ġinst": 1174,
      "##ck": 1175,
      "##ark": 1176,
      "then": 1177,
      "Ġanal": 1178,
      "Ġact": 1179,
      "Ġfact": 1180,
      "##//": 1181,
      "##____": 1182,
      "Ġclass": 1183,
      "##arg": 1184,
      "Ġgiven": 1185,
      "##ational": 1186,
      "Ġgrou": 1187,
      "ex": 1188,
      "Ġinteg": 1189,
      "where": 1190,
      "âĢĿ": 1191,
      "##lo": 1192,
      "Ġthen": 1193,
      "Ġmult": 1194,
      "##==": 1195,
      "##enc": 1196,
      "ĠSt": 1197,
      "##play": 1198,
      "int": 1199,
      "Ġnon": 1200,
      "Ġwr": 1201,
      "##ince": 1202,
      "you": 1203,
      "Ġcase": 1204,
      "Ġsuch": 1205,
      "##ithm": 1206,
      "##bers": 1207,
      "Ġac": 1208,
      "Ġcol": 1209,
      "()": 1210,
      "Ġfollowing": 1211,
      "##omet": 1212,
      "Ġsign": 1213,
      "##ization": 1214,
      "Ġway": 1215,
      "##ever": 1216,
      "You": 1217,
      "##ctions": 1218,
      "Ġterm": 1219,
      "Ġequation": 1220,
      "Ġsm": 1221,
      "St": 1222,
      "##yle": 1223,
      "Ġsee": 1224,
      "##gor": 1225,
      "##ni": 1226,
      "Ġem": 1227,
      "Ġz": 1228,
      "##ities": 1229,
      "##ng": 1230,
      "##ee": 1231,
      "Ġpartic": 1232,
      "##iss": 1233,
      "##arge": 1234,
      "Ġmeasure": 1235,
      "##cept": 1236,
      "##fore": 1237,
      "##inal": 1238,
      "##hes": 1239,
      "##fter": 1240,
      "##ute": 1241,
      "##...": 1242,
      "##ote": 1243,
      "Ġext": 1244,
      "dis": 1245,
      "##pert": 1246,
      "Ġstr": 1247,
      "Ġpr": 1248,
      "Ġansw": 1249,
      "So": 1250,
      "##hed": 1251,
      "##red": 1252,
      "Ġcall": 1253,
      "##irc": 1254,
      "Ġsur": 1255,
      "end": 1256,
      "##ines": 1257,
      "$.": 1258,
      "##rough": 1259,
      "Ġdire": 1260,
      "Ġcould": 1261,
      "pro": 1262,
      "##rent": 1263,
      "##io": 1264,
      "##line": 1265,
      "Ġpa": 1266,
      "##ug": 1267,
      "Ġstate": 1268,
      "##ech": 1269,
      "##ized": 1270,
      "Ġwant": 1271,
      "##ron": 1272,
      "##ential": 1273,
      "##ock": 1274,
      "Ġinv": 1275,
      "##formation": 1276,
      "Ġprob": 1277,
      "##ument": 1278,
      "##pos": 1279,
      "Ġser": 1280,
      "Ġprov": 1281,
      "Ġtest": 1282,
      "}$$": 1283,
      "Ex": 1284,
      "##ength": 1285,
      "There": 1286,
      "Ġvery": 1287,
      "##itive": 1288,
      "Ġele": 1289,
      "##ots": 1290,
      "##ages": 1291,
      "##ctor": 1292,
      "##ym": 1293,
      "Ġelect": 1294,
      "mathrm": 1295,
      "Ġve": 1296,
      "Ġ$$": 1297,
      "Ġener": 1298,
      "ĠIn": 1299,
      "##own": 1300,
      "Ġsec": 1301,
      "Ġbl": 1302,
      "Ġvalues": 1303,
      "Ġprocess": 1304,
      "(\\": 1305,
      "##ish": 1306,
      "##ually": 1307,
      "Ġfield": 1308,
      "##ray": 1309,
      "Ġdec": 1310,
      "##ex": 1311,
      "##ases": 1312,
      "Ġthink": 1313,
      "##ild": 1314,
      "##yn": 1315,
      "Ġmake": 1316,
      "that": 1317,
      "##ral": 1318,
      "Ġbut": 1319,
      "Ġi": 1320,
      "##tern": 1321,
      ")}": 1322,
      "Ġmost": 1323,
      "##inite": 1324,
      "Ġest": 1325,
      "What": 1326,
      "Ġdistrib": 1327,
      "##ampl": 1328,
      "Ġposs": 1329,
      "##ysis": 1330,
      "##ik": 1331,
      "Ġboth": 1332,
      "##ull": 1333,
      "##ting": 1334,
      "))": 1335,
      "Pro": 1336,
      "Ġquestion": 1337,
      "Ġmany": 1338,
      "Ġeffect": 1339,
      "Ġcorre": 1340,
      "Ġlook": 1341,
      "Ġorder": 1342,
      "##elf": 1343,
      "Ġoper": 1344,
      "Ġinf": 1345,
      "##ify": 1346,
      "Ġrequ": 1347,
      "Ġrem": 1348,
      "Ġwell": 1349,
      "##agn": 1350,
      "##ox": 1351,
      "Re": 1352,
      "##ider": 1353,
      "To": 1354,
      "##cal": 1355,
      "Ġent": 1356,
      "##ructure": 1357,
      "Ġenergy": 1358,
      "Ġtri": 1359,
      "by": 1360,
      "Ġwhere": 1361,
      "Ġdi": 1362,
      "##....": 1363,
      "##ets": 1364,
      "##ension": 1365,
      "Ġ@": 1366,
      "##gram": 1367,
      "Ġhigh": 1368,
      "##igure": 1369,
      "$,": 1370,
      "##ier": 1371,
      "Ġdisc": 1372,
      "Ġreal": 1373,
      "As": 1374,
      "##âĪ": 1375,
      "##oint": 1376,
      "##style": 1377,
      "Ġspace": 1378,
      "##aw": 1379,
      "Ġfe": 1380,
      "Ġparamet": 1381,
      "##tic": 1382,
      "ar": 1383,
      "sq": 1384,
      "##gorithm": 1385,
      "##ered": 1386,
      "Ġhere": 1387,
      "do": 1388,
      "##ism": 1389,
      "Al": 1390,
      "##utions": 1391,
      "Ġdon": 1392,
      "display": 1393,
      "Ġpost": 1394,
      "##ubl": 1395,
      "://": 1396,
      "Ġhel": 1397,
      "##ource": 1398,
      "are": 1399,
      "Ġmean": 1400,
      "Ġobject": 1401,
      "##egin": 1402,
      "Ġnumbers": 1403,
      "Ġed": 1404,
      "##app": 1405,
      "Ġsolution": 1406,
      "##up": 1407,
      "##err": 1408,
      "Ġcode": 1409,
      "Ġevery": 1410,
      "Ġtra": 1411,
      "Ġatt": 1412,
      "Ġthrough": 1413,
      "ĠQ": 1414,
      "Ġgraph": 1415,
      "##ency": 1416,
      "ĠPro": 1417,
      ")(": 1418,
      "Ġcomput": 1419,
      "an": 1420,
      "##ann": 1421,
      "Ġke": 1422,
      "Ġ|": 1423,
      "##ident": 1424,
      "Ġincre": 1425,
      "##--------": 1426,
      "Ġfl": 1427,
      "##ume": 1428,
      "displaystyle": 1429,
      "##andom": 1430,
      "sqrt": 1431,
      "Ġright": 1432,
      "##ology": 1433,
      "Ġsmall": 1434,
      "begin": 1435,
      "con": 1436,
      "Com": 1437,
      "Ġresults": 1438,
      "Ġtop": 1439,
      "##eta": 1440,
      "Ġdesc": 1441,
      "Ch": 1442,
      "##AT": 1443,
      "##angle": 1444,
      "##arch": 1445,
      "ph": 1446,
      "##ables": 1447,
      "this": 1448,
      "ĠX": 1449,
      "##ression": 1450,
      "##ero": 1451,
      "Ġanswer": 1452,
      "Ġabove": 1453,
      "##itions": 1454,
      "Ġmin": 1455,
      "##val": 1456,
      "##pr": 1457,
      "Ġmulti": 1458,
      "ĠĠĠĠĠ": 1459,
      "Ġsecond": 1460,
      "Ġmatrix": 1461,
      "Ġmuch": 1462,
      "Ġopt": 1463,
      "Let": 1464,
      "##round": 1465,
      "ĠY": 1466,
      "Ġcond": 1467,
      "##ule": 1468,
      "##fic": 1469,
      "Ġbu": 1470,
      "ch": 1471,
      "##ars": 1472,
      "##eo": 1473,
      "But": 1474,
      "##ner": 1475,
      "##ives": 1476,
      "}^{": 1477,
      "##other": 1478,
      "on": 1479,
      "Ġobser": 1480,
      "Ġexpl": 1481,
      "##andard": 1482,
      "Ġgeneral": 1483,
      "##fer": 1484,
      "##ulation": 1485,
      "Ġcre": 1486,
      "Ġfunctions": 1487,
      "Ġimp": 1488,
      "##etic": 1489,
      "##bl": 1490,
      "##iew": 1491,
      "}_{": 1492,
      "Ġloc": 1493,
      "##ides": 1494,
      "##ane": 1495,
      "Ġlong": 1496,
      "##geb": 1497,
      "ĠThe": 1498,
      "},": 1499,
      "Ġstart": 1500,
      "Ġestim": 1501,
      "##olution": 1502,
      "Ġ,": 1503,
      "Ġbecause": 1504,
      "Ġnow": 1505,
      "Ġsupp": 1506,
      "##pen": 1507,
      "##ward": 1508,
      ")=": 1509,
      "##**": 1510,
      "##dd": 1511,
      "##ural": 1512,
      "Ġread": 1513,
      "Ġquant": 1514,
      "##aract": 1515,
      "##read": 1516,
      "Ġsum": 1517,
      "Ġend": 1518,
      "##sc": 1519,
      "Ġcurrent": 1520,
      "##face": 1521,
      "pi": 1522,
      "cd": 1523,
      "times": 1524,
      "\",": 1525,
      "##ists": 1526,
      "##ead": 1527,
      "Ġcontain": 1528,
      "##pha": 1529,
      "Ġtem": 1530,
      "Ġtheory": 1531,
      "Ġfile": 1532,
      "##ank": 1533,
      "Ġrad": 1534,
      "##ified": 1535,
      "##¿½": 1536,
      "##inu": 1537,
      "Ġtype": 1538,
      "sh": 1539,
      "##rol": 1540,
      "##erest": 1541,
      "Ġexper": 1542,
      "Ġimport": 1543,
      "##ilar": 1544,
      "Ġpossible": 1545,
      "##uth": 1546,
      "Ġ}": 1547,
      "##uring": 1548,
      "##cent": 1549,
      "Ġalgorithm": 1550,
      "##ormal": 1551,
      "Ġsing": 1552,
      "htt": 1553,
      "Ġthree": 1554,
      "Ġmass": 1555,
      "Ġinformation": 1556,
      "Ġconf": 1557,
      "##ven": 1558,
      "Ġmust": 1559,
      "Ġfil": 1560,
      "##of": 1561,
      "Ġbound": 1562,
      "there": 1563,
      "##stand": 1564,
      "Ġinclud": 1565,
      "##imit": 1566,
      "##da": 1567,
      "Ġstructure": 1568,
      "##amples": 1569,
      "##amb": 1570,
      "Ġpropert": 1571,
      "ĠCh": 1572,
      "##ference": 1573,
      "Ġang": 1574,
      "Ġformul": 1575,
      "Ġeven": 1576,
      "Ġerr": 1577,
      "Ġperform": 1578,
      "Ġrepresent": 1579,
      "##uss": 1580,
      "Ġrun": 1581,
      "##ER": 1582,
      "})": 1583,
      "##ynam": 1584,
      "Ġback": 1585,
      "):": 1586,
      "##orem": 1587,
      "Ġdep": 1588,
      "Ġlinear": 1589,
      "Ġchange": 1590,
      "Ġhelp": 1591,
      "Ġ$\\": 1592,
      "And": 1593,
      "}(": 1594,
      "le": 1595,
      "Ġequations": 1596,
      "##akes": 1597,
      "##ross": 1598,
      "##etwork": 1599,
      "##atic": 1600,
      "Ġbas": 1601,
      "Ġpoints": 1602,
      "##imum": 1603,
      "##vious": 1604,
      "Ġder": 1605,
      "res": 1606,
      "Ġgre": 1607,
      "##velop": 1608,
      "part": 1609,
      "##imal": 1610,
      "Ġgood": 1611,
      "##rodu": 1612,
      "Ġprogram": 1613,
      "##ration": 1614,
      "Ġgroup": 1615,
      "âĪĴ": 1616,
      "##verse": 1617,
      "Ġhad": 1618,
      "Ġfound": 1619,
      "##oci": 1620,
      "Ġdeterm": 1621,
      "##par": 1622,
      "Ġmet": 1623,
      ")\\": 1624,
      "Ġlevel": 1625,
      "##ows": 1626,
      "Ġeas": 1627,
      "##aking": 1628,
      "##sing": 1629,
      "Ġet": 1630,
      "##pond": 1631,
      "##imension": 1632,
      "Qu": 1633,
      "Ġinput": 1634,
      "Ġcent": 1635,
      "Ġrat": 1636,
      "##gebra": 1637,
      ");": 1638,
      "Ġlear": 1639,
      "##ears": 1640,
      "##ision": 1641,
      "Ġbased": 1642,
      "Ġvol": 1643,
      "Ġav": 1644,
      "##eb": 1645,
      "##athemat": 1646,
      "Ġanalysis": 1647,
      "##aces": 1648,
      "##au": 1649,
      "Ġdistribution": 1650,
      "##lass": 1651,
      "Ġlist": 1652,
      "Ġafter": 1653,
      "Ġsym": 1654,
      "mathbb": 1655,
      "##ins": 1656,
      "ĠĠĠĠĠĠĠĠĠ": 1657,
      "alpha": 1658,
      "sum": 1659,
      "Ġconstant": 1660,
      "mathbf": 1661,
      "Ġret": 1662,
      "Ġcomplex": 1663,
      "Ġcirc": 1664,
      "##ful": 1665,
      "##ade": 1666,
      "Ġvector": 1667,
      "##plement": 1668,
      "##quare": 1669,
      "##eople": 1670,
      "Ġpower": 1671,
      "Ġide": 1672,
      "##ern": 1673,
      "Ġlog": 1674,
      "##ves": 1675,
      "##ood": 1676,
      "Ġproduct": 1677,
      "Ġlength": 1678,
      "ĊĊĊ": 1679,
      "##ection": 1680,
      "Ġlarge": 1681,
      "ĠÂ": 1682,
      "Ġinterest": 1683,
      "Ġpresent": 1684,
      "Ġident": 1685,
      "ĠCom": 1686,
      "On": 1687,
      "Ġequal": 1688,
      "Sh": 1689,
      "Ġthose": 1690,
      "##requ": 1691,
      "Ġ#": 1692,
      "##elta": 1693,
      "##bol": 1694,
      "Ġrate": 1695,
      "Ġcharact": 1696,
      "Ġstudy": 1697,
      "##estions": 1698,
      "##atist": 1699,
      "##ired": 1700,
      "Ġcalled": 1701,
      "##heck": 1702,
      "However": 1703,
      "Ġ:": 1704,
      "##ertain": 1705,
      "##ivity": 1706,
      "Ġoutput": 1707,
      "Ġunderstand": 1708,
      "Ġbeing": 1709,
      "Ġ<": 1710,
      "Ġpred": 1711,
      "##pec": 1712,
      "##lear": 1713,
      ")^": 1714,
      "##und": 1715,
      "##epend": 1716,
      "##ving": 1717,
      "##perature": 1718,
      "Ġsize": 1719,
      "##rit": 1720,
      "Ġdown": 1721,
      "##els": 1722,
      "Ġdid": 1723,
      "##atrix": 1724,
      "Ġtyp": 1725,
      "##rid": 1726,
      "##ily": 1727,
      "##ton": 1728,
      "##que": 1729,
      "Ġrandom": 1730,
      "##raw": 1731,
      "Ġsequ": 1732,
      "im": 1733,
      "Ġstep": 1734,
      "Ġdirect": 1735,
      "Ġtake": 1736,
      "Ġpoly": 1737,
      "When": 1738,
      "##uc": 1739,
      "##ysics": 1740,
      "theta": 1741,
      "##ness": 1742,
      "Ġ)": 1743,
      "Ġwor": 1744,
      "Ġlo": 1745,
      "##ivid": 1746,
      "##ium": 1747,
      "Ġsingle": 1748,
      "##ither": 1749,
      "##rop": 1750,
      "Ġ>": 1751,
      "Ġapplic": 1752,
      "##rans": 1753,
      "##ason": 1754,
      "Ġstandard": 1755,
      "##ometh": 1756,
      "##ocument": 1757,
      "Ġarg": 1758,
      "Con": 1759,
      "Ġsay": 1760,
      "##etter": 1761,
      "Ġcorrect": 1762,
      "##omething": 1763,
      "Ġcar": 1764,
      "Ġless": 1765,
      "##respond": 1766,
      "Ġdevelop": 1767,
      "Ġvers": 1768,
      "Ġscal": 1769,
      "##pace": 1770,
      "##ted": 1771,
      "##ining": 1772,
      "Ġbelow": 1773,
      "pl": 1774,
      "Ġhy": 1775,
      "Ġmathemat": 1776,
      "##ense": 1777,
      "##view": 1778,
      "##xim": 1779,
      "##ript": 1780,
      "Ġsimple": 1781,
      "Ġtech": 1782,
      "Ġmight": 1783,
      "Ġchang": 1784,
      "##ts": 1785,
      "Ġredu": 1786,
      "Ġtry": 1787,
      "##ification": 1788,
      "Ġmain": 1789,
      "Ġterms": 1790,
      "Ġorig": 1791,
      "##ambda": 1792,
      "Ġtot": 1793,
      "##ention": 1794,
      "Then": 1795,
      "##iod": 1796,
      "##action": 1797,
      "##ality": 1798,
      "cdot": 1799,
      "##oy": 1800,
      "Ġmeans": 1801,
      "##oid": 1802,
      "Ġprobability": 1803,
      "qu": 1804,
      "##ten": 1805,
      "Ġdescrib": 1806,
      "##ool": 1807,
      "Ġhand": 1808,
      "Ġgu": 1809,
      "Ġproblems": 1810,
      "Ġmax": 1811,
      "##eomet": 1812,
      "Ġobtain": 1813,
      "##itial": 1814,
      "Ġstill": 1815,
      "Ġvariable": 1816,
      "Ġ\\\\": 1817,
      "##plied": 1818,
      "}{\\": 1819,
      "],": 1820,
      "##mer": 1821,
      "Ġdepend": 1822,
      "Ġmagn": 1823,
      "}=": 1824,
      "${\\": 1825,
      "Ġarea": 1826,
      "Ġzero": 1827,
      "Ġlimit": 1828,
      "##omial": 1829,
      "##oss": 1830,
      "from": 1831,
      "Ġpaper": 1832,
      "doi": 1833,
      "ll": 1834,
      "Ġhis": 1835,
      "##ensity": 1836,
      "Ġtext": 1837,
      "ve": 1838,
      "##ways": 1839,
      "##ior": 1840,
      "##ault": 1841,
      "##ecause": 1842,
      "def": 1843,
      "Ġmodels": 1844,
      "Ġformula": 1845,
      "Ph": 1846,
      "sin": 1847,
      "Zbl": 1848,
      "Ġcell": 1849,
      "Ġdefined": 1850,
      "Ġderiv": 1851,
      "ĠZ": 1852,
      "##olar": 1853,
      "Ġpeople": 1854,
      "Ġtemperature": 1855,
      "##alk": 1856,
      "be": 1857,
      "##igma": 1858,
      "Ġmon": 1859,
      "##raction": 1860,
      "such": 1861,
      "##led": 1862,
      "Ġnetwork": 1863,
      "Ġseem": 1864,
      "val": 1865,
      "##====": 1866,
      "##met": 1867,
      "##pon": 1868,
      "Ġword": 1869,
      "Ġ*": 1870,
      "##ited": 1871,
      "Ġsimilar": 1872,
      "##}$": 1873,
      "##gg": 1874,
      "##aps": 1875,
      "##verage": 1876,
      "#####": 1877,
      "##arrow": 1878,
      "##ring": 1879,
      "not": 1880,
      "That": 1881,
      "##iment": 1882,
      "##bit": 1883,
      "Ġpredict": 1884,
      "Ġbefore": 1885,
      "##ember": 1886,
      "Ġcharacter": 1887,
      "Ġoff": 1888,
      "##ately": 1889,
      "ĠEx": 1890,
      "beta": 1891,
      "Now": 1892,
      "Ġconsider": 1893,
      "##itud": 1894,
      "Ġpat": 1895,
      "Ġinc": 1896,
      "Ġsystems": 1897,
      "Ġerror": 1898,
      "##ators": 1899,
      "Ġvariables": 1900,
      "##ash": 1901,
      "Ġanother": 1902,
      "Ġparticular": 1903,
      "Ġins": 1904,
      "##istic": 1905,
      "##ystem": 1906,
      "##ices": 1907,
      "Ġpositive": 1908,
      "Ġsomething": 1909,
      "##ixed": 1910,
      "##osed": 1911,
      "cos": 1912,
      "Ġcomb": 1913,
      "##ival": 1914,
      "Ġconver": 1915,
      "âĢĶ": 1916,
      "##inition": 1917,
      "Ġ##": 1918,
      "org": 1919,
      "##con": 1920,
      "Ġdesign": 1921,
      "##ailable": 1922,
      "Ġimportant": 1923,
      "Ġhig": 1924,
      "##ively": 1925,
      "##not": 1926,
      "Ġtotal": 1927,
      "##lease": 1928,
      "col": 1929,
      "Ġfrequ": 1930,
      "Ġref": 1931,
      "Ġwithout": 1932,
      "Ġleast": 1933,
      "Ġbeh": 1934,
      "##ably": 1935,
      "Here": 1936,
      "##ared": 1937,
      "##ert": 1938,
      "##versity": 1939,
      "Ġexpect": 1940,
      "Ġlow": 1941,
      "##umn": 1942,
      "Ġwater": 1943,
      "Ġradi": 1944,
      "Ġcho": 1945,
      "##ordin": 1946,
      "et": 1947,
      "##ï¿½": 1948,
      "Ġ...": 1949,
      "##________": 1950,
      "Ġtre": 1951,
      "##ler": 1952,
      "Ġel": 1953,
      "mod": 1954,
      "##nces": 1955,
      "Ġdiscuss": 1956,
      "##eturn": 1957,
      "##ournal": 1958,
      "Ġsurface": 1959,
      "Ġdistance": 1960,
      "Ġuni": 1961,
      "Ġcount": 1962,
      "un": 1963,
      ".)": 1964,
      "log": 1965,
      "Ġagain": 1966,
      "##âĢĿ": 1967,
      "Ġaddition": 1968,
      "pr": 1969,
      "Ġsupport": 1970,
      "--": 1971,
      "Ġcorrespond": 1972,
      "Is": 1973,
      ")$$": 1974,
      "Ġexist": 1975,
      "##Ã©": 1976,
      "Ġwho": 1977,
      "##ublic": 1978,
      "##set": 1979,
      "##otential": 1980,
      "mu": 1981,
      "##gen": 1982,
      "##ibr": 1983,
      "##ON": 1984,
      "##anc": 1985,
      "##ES": 1986,
      "##angu": 1987,
      "##ected": 1988,
      "Ġreally": 1989,
      "Ġseries": 1990,
      "Ġreturn": 1991,
      "Ġocc": 1992,
      "em": 1993,
      "Ġshown": 1994,
      "##iron": 1995,
      "Ġmade": 1996,
      "##anks": 1997,
      "Ġlight": 1998,
      "Ġelement": 1999,
      "Ġbetter": 2000,
      "Ġapproach": 2001,
      "align": 2002,
      "Ġra": 2003,
      "##ega": 2004,
      "##ames": 2005,
      "##onal": 2006,
      "Ġcompon": 2007,
      "##ackage": 2008,
      "ĠĠĠĠ": 2009,
      "Ġsl": 2010,
      "Ġpass": 2011,
      "Ġneg": 2012,
      "Ġcost": 2013,
      "Ġsample": 2014,
      "Ġwave": 2015,
      "Ġknown": 2016,
      "##aving": 2017,
      "sub": 2018,
      "Ġaround": 2019,
      "##ape": 2020,
      "Ġfactor": 2021,
      "Ġapproxim": 2022,
      "\\\\": 2023,
      "##less": 2024,
      "Ġcommon": 2025,
      "Ġlast": 2026,
      "##ware": 2027,
      "##urther": 2028,
      "over": 2029,
      "Ġwithin": 2030,
      "##ences": 2031,
      "how": 2032,
      "lambda": 2033,
      "##erial": 2034,
      "Ġalways": 2035,
      "partial": 2036,
      "These": 2037,
      "##ene": 2038,
      "Ġcontrol": 2039,
      "Ġtrue": 2040,
      "##orph": 2041,
      "##effic": 2042,
      "##bs": 2043,
      "##inary": 2044,
      "Ġrange": 2045,
      "Ġgive": 2046,
      "##ination": 2047,
      "mathcal": 2048,
      "Ġlet": 2049,
      "##ayer": 2050,
      "Ġexact": 2051,
      "##mega": 2052,
      "##ody": 2053,
      "Ġsquare": 2054,
      "##amma": 2055,
      "##fty": 2056,
      "Ġsa": 2057,
      "##ering": 2058,
      "Ġgra": 2059,
      "Ġcap": 2060,
      "Ġspect": 2061,
      "Ġfree": 2062,
      "##ters": 2063,
      "##hether": 2064,
      "##AR": 2065,
      "one": 2066,
      "Ġpath": 2067,
      "infty": 2068,
      "##oh": 2069,
      "::": 2070,
      "Ġparameters": 2071,
      "min": 2072,
      "##ey": 2073,
      "Ġpop": 2074,
      "##yth": 2075,
      "Ġassum": 2076,
      "Ġleft": 2077,
      "##icient": 2078,
      "##ience": 2079,
      "##ants": 2080,
      "##arm": 2081,
      "##ourse": 2082,
      "##ependent": 2083,
      "Ġpers": 2084,
      "Ġkey": 2085,
      "Note": 2086,
      "Ġthough": 2087,
      "Ġproperties": 2088,
      "Ġfew": 2089,
      "ĊĊĠ": 2090,
      "Ġmot": 2091,
      "${": 2092,
      "Ġnormal": 2093,
      "Ġperiod": 2094,
      "Ġimage": 2095,
      "Ġside": 2096,
      "##inuous": 2097,
      "ĠâĪ": 2098,
      "Ġopen": 2099,
      "Ġcy": 2100,
      "Ġinitial": 2101,
      "Ġreason": 2102,
      "Ġdifference": 2103,
      "ind": 2104,
      "##olds": 2105,
      "##IN": 2106,
      "##ients": 2107,
      "Ġavailable": 2108,
      "^{-": 2109,
      "Ġaut": 2110,
      "].": 2111,
      "see": 2112,
      "Ġ/": 2113,
      "##umber": 2114,
      "Ġatom": 2115,
      "No": 2116,
      "ĠPh": 2117,
      "per": 2118,
      "##df": 2119,
      "Ġcomplete": 2120,
      "Ġmethods": 2121,
      "when": 2122,
      "Ġproject": 2123,
      "=\\": 2124,
      "Ġflow": 2125,
      "Ġdom": 2126,
      "##nomial": 2127,
      "##any": 2128,
      "Ġname": 2129,
      "_{\\": 2130,
      "Ġelements": 2131,
      "Ġimplement": 2132,
      "ĠMathemat": 2133,
      ",\\": 2134,
      "ĠAl": 2135,
      "Ġdem": 2136,
      "',": 2137,
      "Ġpotential": 2138,
      "Ġgl": 2139,
      "##ances": 2140,
      "##wn": 2141,
      "Ġrest": 2142,
      "Ġfeature": 2143,
      "##atter": 2144,
      "##ided": 2145,
      "Ġwhy": 2146,
      "##niversity": 2147,
      "##atch": 2148,
      "##ah": 2149,
      "##ope": 2150,
      "Ġsure": 2151,
      "all": 2152,
      "##ological": 2153,
      "Ġprevious": 2154,
      "##lection": 2155,
      "cm": 2156,
      "Ġfinite": 2157,
      "Ġdeg": 2158,
      "}}}": 2159,
      "Ġtheorem": 2160,
      "Ġunit": 2161,
      "Ġforce": 2162,
      "##hip": 2163,
      "Ġsignific": 2164,
      "}}\\": 2165,
      "##get": 2166,
      "Ġmem": 2167,
      "Ġsolutions": 2168,
      "Ġbook": 2169,
      "Ġpair": 2170,
      "##duct": 2171,
      "Since": 2172,
      "Ġsequence": 2173,
      "Ġcou": 2174,
      "Ġtoo": 2175,
      "##man": 2176,
      "##way": 2177,
      "array": 2178,
      "ĠQu": 2179,
      "Ġweight": 2180,
      "##ains": 2181,
      "##onst": 2182,
      "##vice": 2183,
      "Ġsource": 2184,
      "Ġeither": 2185,
      "##itude": 2186,
      "##equ": 2187,
      "##opy": 2188,
      "##ished": 2189,
      "Ġthings": 2190,
      "##stract": 2191,
      "Ġcheck": 2192,
      "me": 2193,
      "Or": 2194,
      "Ġworks": 2195,
      "Ġdetail": 2196,
      "##usion": 2197,
      "Ġhigher": 2198,
      "Ġcertain": 2199,
      "Ġlink": 2200,
      "no": 2201,
      "Ġbest": 2202,
      "ĠâĢľ": 2203,
      "Ġvis": 2204,
      "##over": 2205,
      "##omm": 2206,
      "Ġhapp": 2207,
      "pm": 2208,
      "##imensional": 2209,
      "##abel": 2210,
      "##viron": 2211,
      "##ands": 2212,
      "##rate": 2213,
      "Ġmaterial": 2214,
      "Ġversion": 2215,
      "Ġappe": 2216,
      "Ġax": 2217,
      "##lation": 2218,
      "Ġalgebra": 2219,
      "Ġview": 2220,
      "##eed": 2221,
      "##air": 2222,
      "By": 2223,
      "data": 2224,
      "Ġartic": 2225,
      "Ġdone": 2226,
      "##thing": 2227,
      "##tical": 2228,
      "df": 2229,
      "Ġsit": 2230,
      "##urs": 2231,
      "cont": 2232,
      "Ġabs": 2233,
      "##oot": 2234,
      "Ġspeed": 2235,
      "Ġshe": 2236,
      "##chan": 2237,
      "##gan": 2238,
      "Int": 2239,
      "can": 2240,
      "Ġwrite": 2241,
      "##oment": 2242,
      "One": 2243,
      "Ġsolve": 2244,
      "Ġquestions": 2245,
      "##{{": 2246,
      "Ġangle": 2247,
      "##odes": 2248,
      "##lu": 2249,
      "Ġrese": 2250,
      "Ġamount": 2251,
      "Ġgoing": 2252,
      "\")": 2253,
      "Post": 2254,
      "Ġconditions": 2255,
      "##alle": 2256,
      "https": 2257,
      "Ġduring": 2258,
      "Ġmark": 2259,
      "Math": 2260,
      "Ġdiag": 2261,
      "##text": 2262,
      "Ġâ": 2263,
      "Ġparameter": 2264,
      "##ures": 2265,
      "##roup": 2266,
      "Ġcoeffic": 2267,
      "Ġlower": 2268,
      "Ġcoordin": 2269,
      "##lying": 2270,
      "##esc": 2271,
      "Ġnext": 2272,
      "##pre": 2273,
      "cl": 2274,
      "##stit": 2275,
      "##idth": 2276,
      "$(": 2277,
      "Ġgeomet": 2278,
      "because": 2279,
      "Ġpage": 2280,
      "Ġdue": 2281,
      "##AS": 2282,
      "##wise": 2283,
      "Ġproof": 2284,
      "Ġmechan": 2285,
      "Ġaverage": 2286,
      "Ġable": 2287,
      "Ġassoci": 2288,
      "##astic": 2289,
      "Ġfram": 2290,
      "Ġhard": 2291,
      "##ocity": 2292,
      "Ġfigure": 2293,
      "Ġindic": 2294,
      "ob": 2295,
      "Ġbit": 2296,
      "sigma": 2297,
      "Ġcourse": 2298,
      "Ġ$$\\": 2299,
      "Ġfour": 2300,
      "##ission": 2301,
      "##eq": 2302,
      "}+": 2303,
      "Ġstatist": 2304,
      "Ġpress": 2305,
      "At": 2306,
      "##inally": 2307,
      "Ġlead": 2308,
      "##AL": 2309,
      "->": 2310,
      "##ccess": 2311,
      "Ġlines": 2312,
      "All": 2313,
      "##icro": 2314,
      "##ector": 2315,
      "Ġintrodu": 2316,
      "Ġflu": 2317,
      "##........": 2318,
      "Ġdat": 2319,
      "Ġimpro": 2320,
